banking-ws-metro-client/src/test/resources/InfoRekeningRequest.xml

<?xml version="1.0" encoding="UTF-8"?>
<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
    <Header/>
    <Body>
        <bank:info xmlns:bank="http://metro.ws.banking.aplikasi/">
            <nomer>123</nomer>
        </bank:info>
    </Body>
</Envelope>

